quiz_data = [
    {
        'question': 'Что такое Python?',
        'options': ['Язык программирования', 'Тип данных', 'Музыкальный инструмент', 'Змея на английском'],
        'correct_option': 0
    },
    {
        'question': 'Какой тип данных используется для хранения целых чисел?',
        'options': ['int', 'float', 'str', 'natural'],
        'correct_option': 0
    },
    {
        'question': 'Что такое PEP 8?',
        'options': ['Стандарт оформления кода Python', 'Библиотека для веба', 'Тип функции', 'Операционная система'],
        'correct_option': 0
    },
    {
        'question': 'Что делает оператор "==" в Python?',
        'options': ['Сравнивает значения', 'Присваивает значение', 'Создает функцию', 'Удаляет переменную'],
        'correct_option': 0
    },
    {
        'question': 'Какая структура данных используется для хранения уникальных элементов?',
        'options': ['set', 'list', 'dict', 'tuple'],
        'correct_option': 0
    },
    {
        'question': 'Что такое список в Python?',
        'options': ['Неизменяемая последовательность', 'Изменяемая последовательность элементов', 'Число', 'Функция'],
        'correct_option': 1
    },
    {
        'question': 'Какая функция используется для вывода на экран?',
        'options': ['input()', 'print()', 'len()', 'open()'],
        'correct_option': 1
    },
    {
        'question': 'Что делает метод append() для списка?',
        'options': ['Удаляет элемент', 'Сортирует список', 'Добавляет элемент в конец списка', 'Возвращает длину списка'],
        'correct_option': 2
    },
    {
        'question': 'Что возвращает функция len()?',
        'options': ['Сумму чисел', 'Длину объекта', 'Минимальное значение', 'Максимальное значение'],
        'correct_option': 1
    },
    {
        'question': 'Что такое словарь (dict) в Python?',
        'options': ['Последовательность элементов', 'Число', 'Коллекция пар ключ-значение', 'Функция'],
        'correct_option': 2
    }
]
